# DropBeamSystem Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BeamSystem..::..DropBeamSystem Method
BeamSystem Class See Also
---
Drop beam system, it will disassociate all members from the beam system and delete the beam system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static void DropBeamSystem(
	BeamSystem beamSystem
)
```

Visual Basic
---
```text
Public Shared Sub DropBeamSystem ( _
	beamSystem As BeamSystem _
)
```

Visual C++
---
```text
public:
static void DropBeamSystem(
	BeamSystem^ beamSystem
)
```

# ### Parameters
beamSystem
    Type: Autodesk.Revit.DB..::..BeamSystemThe beam system to be deleted.
# See Also
BeamSystem Class
Autodesk.Revit.DB Namespace